{
  "contact": {
    "heading": "Software Engineer",
    "contact": "Contact"
  },
  "introduction": {
    "description": "I am a trusted mobile developer with 8+ years of experience in Flutter and cross-platform development. I started in IT support at WIT Solutions before transitioning to development, working with PhoneGap, JavaScript, and PHP. I contributed to a Xamarin startup and played a key role in Liberty Mutual’s Aliro project using C# MVC 5. In 2018, I specialized in Xamarin Forms, earning certifications and leading an ASP.NET migration. After studying English in Ireland (B2 PET Cambridge), I focused on Flutter, taking Tech Lead roles at Camino Education and ArcTouch, delivering high-quality Android and iOS applications.",
    "coding_with": "Coding with ",
    "passion": "passion",
    "teaching_with": "Teaching with ",
    "love": "love"
  },
  "experience": {
    "job": {
      "title": "Experiences",
      "description": "I have 8+ years of experience in web and mobile development, specializing in Flutter. I’ve worked Mobile, Front-End and Back-End.",
      "area": {
        "mobile": {
          "title": "Mobile",
          "skills": {
            "flutter": "Flutter",
            "xamarin": "Xamarin",
            "kotlin": "Kotlin",
            "swift": "Swift"
          }
        },
        "frontend": {
          "title": "Front-End",
          "skills": {
            "react": "React",
            "typescript": "Typescript",
            "javascript": "Javascript",
            "sass": "Sass",
            "tailwindcss": "TailwindCSS"
          }
        },
        "backend": {
          "title": "Back-End",
          "skills": {
            "csharp": "C#",
            "dotNetCore": ".Net Core"
          }
        },
        "others": {
          "title": "Others",
          "skills": {
            "firebase": "Firebase",
            "sqlServer": "SQL Server",
            "GraphQL": "GraphQL"
          }
        }
      }
    },
    "youtube": {
      "title": "Youtube Channel",
      "description": "I co-founded Pub Dev, a YouTube channel focused on Flutter development, where I create content to simplify complex topics. Teaching is something I enjoy, whether mentoring developers or creating tutorials, as it helps others grow while reinforcing my own knowledge.",
      "skills": {
        "pubdev": "Pub Dev"
      }
    },
    "education": {
      "title": "Education",
      "description": "I hold a degree in Analysis and Development of Systems and have furthered my education by studying web front-end development at Cornerstone. This has helped me strengthen my skills and broaden my expertise in the field of technology.",
      "option1": {
        "title": "Analyses and Development System",
        "from": "Brazil",
        "period": "Jan 2012 - Jun 2014"
      },
      "option2": {
        "title": "Front-End Web Development",
        "from": "Canada",
        "period": "Jan 2025 - Dec 2026"
      }
    },
    "language": {
      "title": "Languages",
      "description": "I am proficient in both English and Portuguese. I enhanced my language skills through exchange programs in Ireland and Canada, which helped me gain a deeper understanding of different cultures and improve my communication abilities.",
      "skills": {
        "english": "English",
        "portuguese": "Portuguese"
      }
    },
    "hobbie": {
      "title": "hobbies",
      "description": "In my free time, I enjoy playing games, drawing, and serving as a Game Master for tabletop RPGs (TRPGs). These hobbies allow me to be creative, think strategically, and engage in storytelling with others.",
      "skills": {
        "lol": "League of Legends",
        "valorant": "Valorant",
        "trpg": "TRPG"
      }
    }
  },
  "code": {
    "1": "The code for this website is available on the ",
    "2": "GitHub repository",
    "3": ". Thank you for visiting!"
  }
}
