{
  "contact": {
    "heading": "Software Engineer",
    "contact": "Contato"
  },
  "introduction": {
    "description": "Sou um desenvolvedor mobile confiável com mais de 8 anos de experiência em Flutter e desenvolvimento cross-platform. Comecei em suporte de TI na WIT Solutions antes de transitar para o desenvolvimento, trabalhando com PhoneGap, JavaScript e PHP. Contribuí para uma startup Xamarin e desempenhei um papel chave no projeto Aliro da Liberty Mutual, utilizando C# MVC 5. Em 2018, especializei-me em Xamarin Forms, obtendo certificações. Após estudar inglês na Irlanda (B2 PET Cambridge), concentrei-me no Flutter, assumindo cargos de Tech Lead na Camino Education e ArcTouch, entregando aplicativos Android e iOS de alta qualidade.",
    "coding_with": "Codando com ",
    "passion": "paixao",
    "teaching_with": "Ensinando com ",
    "love": "amor"
  },
  "experience": {
    "job": {
      "title": "Experiência Profissional",
      "description": "Tenho mais de 8 anos de experiência em desenvolvimento web e mobile, especializado em Flutter. Trabalhei com ArcTouch, Camino Education, Yamaha Group, Banco Safra e Liberty Mutual, utilizando tecnologias como Kotlin, Swift, C# e JavaScript.",
      "skills": {
        "flutter": "Flutter",
        "android": "Android",
        "ios": "iOS",
        "csharp": "C#",
        "react": "React",
        "sass": "Sass",
        "agile": "Agile",
        "scrum": "Scrum",
        "kanban": "Kanban"
      }
    },
    "youtube": {
      "title": "Canal no YouTube",
      "description": "Fundador do Pub Dev, um canal no YouTube focado no desenvolvimento Flutter, onde crio conteúdo para simplificar tópicos complexos. Ensinar é algo que gosto, seja mentorando desenvolvedores ou criando tutoriais, pois ajuda os outros a crescer enquanto reforça meu próprio conhecimento.",
      "skills": {
        "pubdev": "Pub Dev"
      }
    },
    "education": {
      "title": "Educação",
      "description": "Sou formado em Análise e Desenvolvimento de Sistemas e ampliei minha educação estudando desenvolvimento front-end web na Cornerstone. Isso me ajudou a fortalecer minhas habilidades e ampliar minha expertise na área de tecnologia.",
      "option1": {
        "title": "Analise e Desenvolvimento de Sistema",
        "from": "Brasil",
        "period": "Jan 2012 - Jun 2014"
      },
      "option2": {
        "title": "Front-End Web Development",
        "from": "Canada",
        "period": "Jan 2025 - Dez 2026"
      }
    },
    "language": {
      "title": "Idioma",
      "description": "Tenho proficiência em inglês e português. Aperfeiçoei minhas habilidades linguísticas por meio de programas de intercâmbio na Irlanda e no Canadá, o que me ajudou a entender melhor diferentes culturas e aprimorar minhas habilidades de comunicação.",
      "skills": {
        "english": "Inglês",
        "portuguese": "Português"
      }
    },
    "hobbie": {
      "title": "Hobbies",
      "description": "No meu tempo livre, gosto de jogar, desenhar e jogar RPGs de mesa com meus amigos (TRPGs). Esses hobbies me permite relaxar e me manter sempre bem motivado.",
      "skills": {
        "lol": "League of Legends",
        "valorant": "Valorant",
        "trpg": "TRPG"
      }
    }
  },
  "code": {
    "1": "O codigo do site esta disponivel no",
    "2": "repositório do GitHub",
    "3": ". Obrigado pela visita!"
  }
}
